public class TestClass29 {
    //урок 29 ооп инкапсуляция
    //все что внутри класса остается внутри класса - при помощи модификаторов доступа.
    //public - доступ внутри прокта для всех
    //private - закрывает доступ, может использоваться только внутри своего класса
    //protected - закрывает доступ для всех кроме: класса родителя и классов детей - наследников.
    //дефолтный (не указываем) - доступ на уровне пакета
    //стремимся описывать и закрывать переменные

    //при закрытии нам нужны геттеры и сеттеры, для быстрого создания альт+инсерт
}
